OpenNuvoton/NuTool-PinConfigure/Header/NANO100AN/sys.h
#define SYS_PD_L_MFP_PD3_MFP_GPD3         (0UL<<SYS_PD_L_MFP_PD3_MFP_Pos)     /*!<PD3 Pin Function - GPIOD[3] */
#define SYS_PD_L_MFP_PD3_MFP_UART1_CTS    (1UL<<SYS_PD_L_MFP_PD3_MFP_Pos)     /*!<PD3 Pin Function - UART1 CTSn */
#define SYS_PD_L_MFP_PD3_MFP_I2S_BCLK     (2UL<<SYS_PD_L_MFP_PD3_MFP_Pos)     /*!<PD3 Pin Function - I2S BCLK */
#define SYS_PD_L_MFP_PD3_MFP_SPI2_MOSI0   (3UL<<SYS_PD_L_MFP_PD3_MFP_Pos)     /*!<PD3 Pin Function - SPI2 MOSI[0] */
#define SYS_PD_L_MFP_PD3_MFP_SC1_RST      (4UL<<SYS_PD_L_MFP_PD3_MFP_Pos)     /*!<PD3 Pin Function - SmartCard1 reset */

#define SYS_PD_L_MFP_PD2_MFP_GPD2         (0UL<<SYS_PD_L_MFP_PD2_MFP_Pos)     /*!<PD2 Pin Function - GPIOD[2] */
#define SYS_PD_L_MFP_PD2_MFP_UART1_RTS    (1UL<<SYS_PD_L_MFP_PD2_MFP_Pos)     /*!<PD2 Pin Function - UART1 RTSn */
#define SYS_PD_L_MFP_PD2_MFP_I2S_WS       (2UL<<SYS_PD_L_MFP_PD2_MFP_Pos)     /*!<PD2 Pin Function - I2S WS */
#define SYS_PD_L_MFP_PD2_MFP_SPI2_MISO0   (3UL<<SYS_PD_L_MFP_PD2_MFP_Pos)     /*!<PD2 Pin Function - SPI2 MISO[0] */
#define SYS_PD_L_MFP_PD2_MFP_SC1_PWR      (4UL<<SYS_PD_L_MFP_PD2_MFP_Pos)     /*!<PD2 Pin Function - SmartCard1 power */

#define SYS_PD_L_MFP_PD1_MFP_GPD1         (0UL<<SYS_PD_L_MFP_PD1_MFP_Pos)     /*!<PD1 Pin Function - GPIOD[1] */
#define SYS_PD_L_MFP_PD1_MFP_UART1_TX     (1UL<<SYS_PD_L_MFP_PD1_MFP_Pos)     /*!<PD1 Pin Function - UART1 TX */
#define SYS_PD_L_MFP_PD1_MFP_SPI2_SCLK    (3UL<<SYS_PD_L_MFP_PD1_MFP_Pos)     /*!<PD1 Pin Function - SPI2 SCLK */
#define SYS_PD_L_MFP_PD1_MFP_SC1_DAT      (4UL<<SYS_PD_L_MFP_PD1_MFP_Pos)     /*!<PD1 Pin Function - SmartCard1 DATA */

#define SYS_PD_L_MFP_PD0_MFP_GPD0         (0UL<<SYS_PD_L_MFP_PD0_MFP_Pos)     /*!<PD0 Pin Function - GPIOD[0] */
#define SYS_PD_L_MFP_PD0_MFP_UART1_RX     (1UL<<SYS_PD_L_MFP_PD0_MFP_Pos)     /*!<PD0 Pin Function - UART1 RX */
#define SYS_PD_L_MFP_PD0_MFP_SPI2_SS0     (3UL<<SYS_PD_L_MFP_PD0_MFP_Pos)     /*!<PD0 Pin Function - SPI2 chip selection 0 */
#define SYS_PD_L_MFP_PD0_MFP_SC1_CLK      (4UL<<SYS_PD_L_MFP_PD0_MFP_Pos)     /*!<PD0 Pin Function - SmartCard1 clock */

/********************* Bit definition of PD_H_MFP register **********************/
#define SYS_PD_H_MFP_PD15_MFP_GPD15       (0UL<<SYS_PD_H_MFP_PD15_MFP_Pos)      /*!<PD15 Pin Function - GPIOD[15] */

#define SYS_PD_H_MFP_PD14_MFP_GPD14       (0UL<<SYS_PD_H_MFP_PD14_MFP_Pos)      /*!<PD14 Pin Function - GPIOD[14] */

#define SYS_PD_H_MFP_PD13_MFP_GPD13       (0UL<<SYS_PD_H_MFP_PD13_MFP_Pos)      /*!<PD13 Pin Function - GPIOD[13] */

#define SYS_PD_H_MFP_PD12_MFP_GPD12       (0UL<<SYS_PD_H_MFP_PD12_MFP_Pos)      /*!<PD12 Pin Function - GPIOD[12] */

#define SYS_PD_H_MFP_PD11_MFP_GPD11       (0UL<<SYS_PD_H_MFP_PD11_MFP_Pos)      /*!<PD11 Pin Function - GPIOD[11] */

#define SYS_PD_H_MFP_PD10_MFP_GPD10       (0UL<<SYS_PD_H_MFP_PD10_MFP_Pos)      /*!<PD10 Pin Function - GPIOD[10] */

#define SYS_PD_H_MFP_PD9_MFP_GPD9         (0UL<<SYS_PD_H_MFP_PD9_MFP_Pos)     /*!<PD9 Pin Function - GPIOD[9] */

#define SYS_PD_H_MFP_PD8_MFP_GPD8         (0UL<<SYS_PD_H_MFP_PD8_MFP_Pos)     /*!<PD8 Pin Function - GPIOD[8] */

/********************* Bit definition of PE_L_MFP register **********************/
#define SYS_PE_L_MFP_PE7_MFP_GPE7         (0UL<<SYS_PE_L_MFP_PE7_MFP_Pos)     /*!<PE7 Pin Function - GPIOE[7] */

#define SYS_PE_L_MFP_PE6_MFP_GPE6         (0UL<<SYS_PE_L_MFP_PE6_MFP_Pos)     /*!<PE6 Pin Function - GPIOE[6] */

#define SYS_PE_L_MFP_PE5_MFP_GPE5         (0UL<<SYS_PE_L_MFP_PE5_MFP_Pos)     /*!<PE5 Pin Function - GPIOE[5] */
#define SYS_PE_L_MFP_PE5_MFP_PWM1_CH1     (1UL<<SYS_PE_L_MFP_PE5_MFP_Pos)     /*!<PE5 Pin Function - PWM1 Channel 1 */

#define SYS_PE_L_MFP_PE4_MFP_GPE4         (0UL<<SYS_PE_L_MFP_PE4_MFP_Pos)     /*!<PE4 Pin Function - GPIOE[4] */
#define SYS_PE_L_MFP_PE4_MFP_SPI0_MOSI0   (6UL<<SYS_PE_L_MFP_PE4_MFP_Pos)     /*!<PE4 Pin Function - SPI0 MOSI[0] */

#define SYS_PE_L_MFP_PE3_MFP_GPE3         (0UL<<SYS_PE_L_MFP_PE3_MFP_Pos)     /*!<PE3 Pin Function - GPIOE[3] */
#define SYS_PE_L_MFP_PE3_MFP_SPI0_MISO0   (6UL<<SYS_PE_L_MFP_PE3_MFP_Pos)     /*!<PE3 Pin Function - SPI0 MISO[0] */

#define SYS_PE_L_MFP_PE2_MFP_GPE2         (0UL<<SYS_PE_L_MFP_PE2_MFP_Pos)     /*!<PE2 Pin Function - GPIOE[2] */
#define SYS_PE_L_MFP_PE2_MFP_SPI0_SCLK    (6UL<<SYS_PE_L_MFP_PE2_MFP_Pos)     /*!<PE2 Pin Function - SPI0 SCLK */

#define SYS_PE_L_MFP_PE1_MFP_GPE1         (0UL<<SYS_PE_L_MFP_PE1_MFP_Pos)     /*!<PE1 Pin Function - GPIOE[1] */
#define SYS_PE_L_MFP_PE1_MFP_PWM1_CH3     (1UL<<SYS_PE_L_MFP_PE1_MFP_Pos)     /*!<PE1 Pin Function - PWM1 Channel 3 */
#define SYS_PE_L_MFP_PE1_MFP_SPI0_SS0     (6UL<<SYS_PE_L_MFP_PE1_MFP_Pos)     /*!<PE1 Pin Function - SPI0 chip selection 0 */

#define SYS_PE_L_MFP_PE0_MFP_GPE0         (0UL<<SYS_PE_L_MFP_PE0_MFP_Pos)     /*!<PE0 Pin Function - GPIOE[0] */
#define SYS_PE_L_MFP_PE0_MFP_PWM1_CH2     (1UL<<SYS_PE_L_MFP_PE0_MFP_Pos)     /*!<PE0 Pin Function - PWM1 Channel 2 */
#define SYS_PE_L_MFP_PE0_MFP_I2S_MCLK     (2UL<<SYS_PE_L_MFP_PE0_MFP_Pos)     /*!<PE0 Pin Function - I2S MCLK */

/********************* Bit definition of PE_H_MFP register **********************/
#define SYS_PE_H_MFP_PE15_MFP_GPE15       (0UL<<SYS_PE_H_MFP_PE15_MFP_Pos)      /*!<PE15 Pin Function - GPIOE[15] */

#define SYS_PE_H_MFP_PE14_MFP_GPE14       (0UL<<SYS_PE_H_MFP_PE14_MFP_Pos)      /*!<PE14 Pin Function - GPIOE[14] */

#define SYS_PE_H_MFP_PE13_MFP_GPE13       (0UL<<SYS_PE_H_MFP_PE13_MFP_Pos)      /*!<PE13 Pin Function - GPIOE[13] */

#define SYS_PE_H_MFP_PE12_MFP_GPE12       (0UL<<SYS_PE_H_MFP_PE12_MFP_Pos)      /*!<PE12 Pin Function - GPIOE[12] */

#define SYS_PE_H_MFP_PE11_MFP_GPE11       (0UL<<SYS_PE_H_MFP_PE11_MFP_Pos)      /*!<PE11 Pin Function - GPIOE[11] */

#define SYS_PE_H_MFP_PE10_MFP_GPE10       (0UL<<SYS_PE_H_MFP_PE10_MFP_Pos)      /*!<PE10 Pin Function - GPIOE[10] */

#define SYS_PE_H_MFP_PE9_MFP_GPE9         (0UL<<SYS_PE_H_MFP_PE9_MFP_Pos)     /*!<PE9 Pin Function - GPIOE[9] */

#define SYS_PE_H_MFP_PE8_MFP_GPE8         (0UL<<SYS_PE_H_MFP_PE8_MFP_Pos)     /*!<PE8 Pin Function - GPIOA[8] */

/********************* Bit definition of PF_L_MFP register **********************/
#define SYS_PF_L_MFP_PF5_MFP_GPF5         (0UL<<SYS_PF_L_MFP_PF5_MFP_Pos)     /*!<PF5 Pin Function - GPIOF[5] */
#define SYS_PF_L_MFP_PF5_MFP_I2C0_SCL     (1UL<<SYS_PF_L_MFP_PF5_MFP_Pos)     /*!<PF5 Pin Function - I2C0 clock */

#define SYS_PF_L_MFP_PF4_MFP_GPF4         (0UL<<SYS_PF_L_MFP_PF4_MFP_Pos)     /*!<PF4 Pin Function - GPIOF[4] */
#define SYS_PF_L_MFP_PF4_MFP_I2C0_SDA     (1UL<<SYS_PF_L_MFP_PF4_MFP_Pos)     /*!<PF4 Pin Function - I2C0 DATA */

